#+title: Java 8 web services
#+author: José Miguel Martínez Carrasco
#+email: jm@0pt1mates.com
#+EXPORT_EXCLUDE_TAGS: noexport

* Introduction

Develop REST web services with:

- [[https://dropwizard.github.io/dropwizard/index.html][Dropwizard]]
- [[http://www.gradle.org][Gradle]]
- java 8

* Dropwizard tutorial

It is a gradle version of the [[https://dropwizard.github.io/dropwizard/getting-started.html][tutorial]].

#+BEGIN_SRC bash
gradle --daemon
gradle clean build
gradle shadowJar
java -jar build/libs/dropwizard-tutorial-1.0-all.jar server hello-world.yml
#+END_SRC

* Time report                                                      :noexport:
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2014-07-22 Tue 02:15]
| Headline                     | Time      |       |
|------------------------------+-----------+-------|
| *Total time*                 | *1d 1:54* |       |
|------------------------------+-----------+-------|
| Time report                  | 1d 1:54   |       |
| \__ DONE gradle installation |           |  0:07 |
| \__ DONE dropwizard tutorial |           |  2:14 |
| \__ TODO dropwizard testing  |           |  1:48 |
| \__ DONE gradle openjdk 8    |           |  0:31 |
| \__ TODO java 8              |           | 14:48 |
| \__ TODO xslt                |           |  6:26 |
#+END:

** DONE gradle installation
   CLOCK: [2014-06-20 Fri 12:00]--[2014-06-20 Fri 12:07] =>  0:07

** DONE dropwizard tutorial
   CLOCK: [2014-06-20 Fri 16:08]--[2014-06-20 Fri 16:27] =>  0:19
   CLOCK: [2014-06-20 Fri 12:25]--[2014-06-20 Fri 14:20] =>  1:55

** TODO dropwizard testing
   CLOCK: [2014-06-21 Sat 14:30]--[2014-06-21 Sat 16:18] =>  1:48

** DONE gradle openjdk 8
   CLOCK: [2014-06-20 Fri 15:26]--[2014-06-20 Fri 15:57] =>  0:31

** TODO java 8
   CLOCK: [2014-06-27 Fri 14:36]--[2014-06-27 Fri 15:14] =>  0:38
   CLOCK: [2014-06-27 Fri 12:14]--[2014-06-27 Fri 14:35] =>  2:21
   CLOCK: [2014-06-26 Thu 14:23]--[2014-06-26 Thu 15:24] =>  1:01
   CLOCK: [2014-06-25 Wed 14:10]--[2014-06-25 Wed 17:16] =>  3:06
   CLOCK: [2014-06-25 Wed 12:45]--[2014-06-25 Wed 13:52] =>  1:07
   CLOCK: [2014-06-25 Wed 10:37]--[2014-06-25 Wed 11:55] =>  1:18
   CLOCK: [2014-06-24 Tue 13:13]--[2014-06-24 Tue 14:57] =>  1:44
   CLOCK: [2014-06-24 Tue 10:14]--[2014-06-24 Tue 11:25] =>  1:11
   CLOCK: [2014-06-23 Mon 13:55]--[2014-06-23 Mon 14:31] =>  0:36
   CLOCK: [2014-06-23 Mon 11:28]--[2014-06-23 Mon 13:14] =>  1:46

** TODO xslt
   CLOCK: [2014-07-21 Mon 22:24]--[2014-07-22 Tue 02:15] =>  3:51
   CLOCK: [2014-06-27 Fri 20:46]--[2014-06-27 Fri 23:21] =>  2:35

* Notes                                                            :noexport:

I followed this [[http://www.xradiograph.com/Emacs/OrgMode#toc12][link]].

Export README.org to markdown. Install the following packages via **M x package-install**

- markdown-mode
- markdown-mode+

And run:

#+BEGIN_SRC bash
org-mode-export-to-markdown
#+END_SRC
